package com.ezenfit.gm.freeboard.dao;

import java.util.List;

import org.springframework.dao.DataAccessException;

import com.ezenfit.gm.freeboard.service.FreeBoardService;
import com.ezenfit.gm.vo.Criteria;
import com.ezenfit.gm.vo.FreeBoardCommentVO;
import com.ezenfit.gm.vo.FreeBoardVO;

//-----------------------------------------------------------------------------------------------------------
// public interface FreeBoardDAO
//-----------------------------------------------------------------------------------------------------------
public interface FreeBoardDAO {
	
	//-----------------------------------------------------------------------------------------------------------
	// 자유게시판(freeboard)리스트 가져오기
	//-----------------------------------------------------------------------------------------------------------		
	public List<FreeBoardVO> freeBoardList(Criteria cri) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 자유게시판 리스트 카운트
	//-----------------------------------------------------------------------------------------------------------		
	public int listCount() throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 게시글 추가
	//-----------------------------------------------------------------------------------------------------------	
	public int addPosts(FreeBoardVO freeBoardVO) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 게시글 보기
	//-----------------------------------------------------------------------------------------------------------
	public FreeBoardVO freeBoardViewPosts(int freeBoard_no) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 자유게시판(freeboard) 댓글리스트 가져오기
	//-----------------------------------------------------------------------------------------------------------		
	public List<FreeBoardCommentVO> freeBoardViewCommentsList(int freeBoard_no) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 수정 하기
	//-----------------------------------------------------------------------------------------------------------		
	public int modPosts(FreeBoardVO freeBoardVO) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 게시글 삭제
	//-----------------------------------------------------------------------------------------------------------	
	public int freeBoardDeletePosts(int freeBoard_no) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 댓글 추가
	//-----------------------------------------------------------------------------------------------------------	
	public int addComments(FreeBoardCommentVO freeBoardCommentVO) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 페이지 이동할 때 필요한 게시글 번호를 가여져오기 위함
	//-----------------------------------------------------------------------------------------------------------
	public FreeBoardCommentVO fbcvo(int freeBoard_commentNO) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 댓글 삭제
	//-----------------------------------------------------------------------------------------------------------
	public int deleteComments(FreeBoardCommentVO freeBoardCommentVO) throws DataAccessException;
	
	//-----------------------------------------------------------------------------------------------------------
	// 답글 리스트 불러오기
	//-----------------------------------------------------------------------------------------------------------
	public List<FreeBoardCommentVO> replyList(int freeBoard_commentParentsNO) throws DataAccessException;

	//-----------------------------------------------------------------------------------------------------------
	// 이미지 파일 명 count ==> 안겹치게 하기 위해서
	//-----------------------------------------------------------------------------------------------------------
	public int imgCount(String freeBoard_imageFileName) throws DataAccessException;
} // End - public interface FreeBoardDAO
